// Задача 50: Напишите программу, которая на вход принимает позиции элемента 
// в двумерном массиве, и возвращает значение этого элемента или же указание, 
// что такого элемента нет.

Console.WriteLine();

int[,] array 
Console.WriteLine("Введите номер строки:");
int row = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите номер столбца:");
int column = Convert.ToInt32(Console.ReadLine());
